# SetReleaseType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalMember..::..SetReleaseType Method
AnalyticalMember Class See Also
---
Sets the release type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void SetReleaseType(
	bool start,
	ReleaseType releaseType
)
```

Visual Basic
---
```text
Public Sub SetReleaseType ( _
	start As Boolean, _
	releaseType As ReleaseType _
)
```

Visual C++
---
```text
public:
void SetReleaseType(
	bool start,
	ReleaseType releaseType
)
```

# ### Parameters
start
    Type: System..::..Boolean The position on Analytical Member element. True for start, false for end.
releaseType
    Type: Autodesk.Revit.DB.Structure..::..ReleaseType The type of release.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace